In [153]:
import pandas as pd
import numpy as np
# Second Highest Salary
data = {
    "id": range(1, 11),  # Sample IDs from 1 to 10
    "salary": [70000, 85000, 85000, 50000, 95000, 95000, 80000, 45000, 40000, 60000]  # Various salaries, including duplicates
}

employee = pd.DataFrame(data)

employee

   id  salary
0   1   70000
1   2   85000
2   3   85000
3   4   50000
4   5   95000
5   6   95000
6   7   80000
7   8   45000
8   9   40000
9  10   60000

In [154]:
employee = employee.drop_duplicates(['salary'])
employee = employee.sort_values(['salary'], ascending=False).reset_index(drop=True)
if len(employee)>1:
    result = pd.DataFrame({'SecondHighestSalary' : [employee.iloc[1]['salary']]})
else:
    result = pd.DataFrame({'SecondHighestSalary' : [None]})
result

   SecondHighestSalary
0                85000

In [164]:
# Capital gain loss
data = {
    "stock_name": ["AAPL", "AAPL", "AAPL", "GOOG", "GOOG", "AAPL", "GOOG", "AAPL", "GOOG", "AAPL"],
    "operation": ["buy", "buy", "sell", "buy", "sell", "sell", "buy", "buy", "sell", "sell"],
    "operation_day": [1, 3, 5, 2, 4, 6, 7, 8, 9, 10],
    "price": [150, 155, 160, 2700, 2750, 158, 2800, 152, 2900, 162]
}
stocks = pd.DataFrame(data)
stocks

  stock_name operation  operation_day  price
0       AAPL       buy              1    150
1       AAPL       buy              3    155
2       AAPL      sell              5    160
3       GOOG       buy              2   2700
4       GOOG      sell              4   2750
5       AAPL      sell              6    158
6       GOOG       buy              7   2800
7       AAPL       buy              8    152
8       GOOG      sell              9   2900
9       AAPL      sell             10    162

In [165]:
stocks = stocks.groupby(['stock_name','operation']).sum().reset_index()
stocks['capital_gain_loss'] = stocks.groupby('stock_name')['price'].diff()
stocks = stocks[stocks['capital_gain_loss'].notna()][['stock_name','capital_gain_loss']]
stocks

  stock_name  capital_gain_loss
1       AAPL               23.0
3       GOOG              150.0

In [185]:
from datetime import datetime
# Movie rating
movies_data = {
    'movie_id': [1, 2, 3, 4],
    'title': ['Inception', 'The Matrix', 'Interstellar', 'The Dark Knight']
}
movies = pd.DataFrame(movies_data)

users_data = {
    'user_id': [101, 102, 103, 104],
    'name': ['Alice', 'Bob', 'Charlie', 'David']
}
users = pd.DataFrame(users_data)

ratings_data = {
    'movie_id': [1, 2, 3, 1, 4, 3],
    'user_id': [101, 102, 101, 103, 104, 102],
    'rating': [5, 4, 5, 3, 5, 4],
    'created_at': [datetime(2020, 1, 1), datetime(2020, 2, 2), datetime(2020, 1, 3), datetime(2020, 2, 4), datetime(2020, 2, 5), datetime(2020, 1, 6)]
}
movie_rating = pd.DataFrame(ratings_data)

   user_id     name
0      101    Alice
1      102      Bob
2      103  Charlie
3      104    David

In [220]:
Users_df = movie_rating.merge(users, on='user_id', how='left')
Movies_df = movie_rating.merge(movies, on='movie_id', how='left')
Movies_df = Movies_df[Movies_df['created_at'].dt.to_period('M') == '2020-02']
user_max_rating_df = Users_df.groupby('name')['rating'].count().reset_index().sort_values(by=['rating', 'name'], ascending=[False, True]).head(1)
movie_highest_avg_df = Movies_df.groupby('title')['rating'].mean().reset_index().sort_values(by=['rating', 'title'], ascending=[False, True]).head(1)
res = pd.concat([user_max_rating_df['name'],movie_highest_avg_df['title']]).to_frame()
res.rename(columns={0:'results'})

           results
0            Alice
1  The Dark Knight

In [51]:
# 1st task
data = {
    'company': ['Apple', 'Microsoft', 'Amazon', 'Alphabet', 'Tesla', 'Facebook', 'Berkshire Hathaway', 'Alibaba', 'Samsung', 'Tencent'],
    'profits': [59.6, 51.3, 33.4, 40.3, 4.6, 29.1, 81.4, 16.5, 22.3, 34.0]
}

forbes_global = pd.DataFrame(data)

forbes_global

              company  profits
0               Apple     59.6
1           Microsoft     51.3
2              Amazon     33.4
3            Alphabet     40.3
4               Tesla      4.6
5            Facebook     29.1
6  Berkshire Hathaway     81.4
7             Alibaba     16.5
8             Samsung     22.3
9             Tencent     34.0

In [54]:
forbes_global = forbes_global.sort_values(['profits'], ascending=False)
forbes_global.reset_index(drop=True).head(3)

              company  profits
0  Berkshire Hathaway     81.4
1               Apple     59.6
2           Microsoft     51.3

In [61]:
data = {
    'user_id': [101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111],
    'name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'Grace', 'Hannah', 'Ivy', 'Jack', 'Me'],
    'status': ['open', 'closed', 'open', 'open', 'closed', 'open', 'closed', 'open', 'open', 'closed', 'open'],
    'country': ['USA', 'Canada', 'UK', 'Australia', 'Germany', 'India', 'France', 'Brazil', 'Japan', 'Mexico', 'USA']
}

fb_active_users = pd.DataFrame(data)

fb_active_users

    user_id     name  status    country
0       101    Alice    open        USA
1       102      Bob  closed     Canada
2       103  Charlie    open         UK
3       104    David    open  Australia
4       105      Eva  closed    Germany
5       106    Frank    open      India
6       107    Grace  closed     France
7       108   Hannah    open     Brazil
8       109      Ivy    open      Japan
9       110     Jack  closed     Mexico
10      111       Me    open        USA

In [65]:
fb_active_users[(fb_active_users['status'] == 'open') & (fb_active_users['country'] == 'USA')].reset_index(drop=True)

   user_id   name status country
0      101  Alice   open     USA
1      111     Me   open     USA

In [104]:
# 3
data_eu = {
    'date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
    'consumption': [120.5, 110.3, 130.0, 125.7, 118.9]
}
fb_eu_energy = pd.DataFrame(data_eu)

data_asia = {
    'date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
    'consumption': [200.5, 210.7, 205.3, 215.0, 198.6]
}
fb_asia_energy = pd.DataFrame(data_asia)

data_na = {
    'date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
    'consumption': [150.8, 145.3, 160.0, 155.2, 149.6]
}
fb_na_energy = pd.DataFrame(data_na)

In [112]:
total = pd.concat([fb_eu_energy, fb_asia_energy, fb_na_energy]).reset_index(drop=True).groupby(by=['date']).sum()
total.sort_values(['consumption'], ascending=False).head(1)

            consumption
date
2024-01-04        495.9

In [69]:
# 4
data = {
    'start_date': ['2024-10-01 08:30:00', '2024-10-01 10:00:00', '2024-10-02 12:15:00', '2024-10-03 15:30:00', '2024-10-04 09:45:00'],
    'end_date': ['2024-10-01 09:00:00', '2024-10-01 10:45:00', '2024-10-02 13:00:00', '2024-10-03 16:15:00', '2024-10-04 10:30:00'],
    'category': ['Business', 'Personal', 'Business', 'Personal', 'Business'],
    'start': ['Downtown', 'Airport', 'Office', 'Mall', 'Station'],
    'stop': ['Airport', 'Downtown', 'Client Site', 'Home', 'Downtown'],
    'miles': [12.5, 18.3, 10.8, 15.6, 5.4],
    'purpose': ['Meeting', 'Leisure', 'Client Visit', 'Shopping', 'Meeting']
}

data['start_date'] = pd.to_datetime(data['start_date'])
data['end_date'] = pd.to_datetime(data['end_date'])

my_uber_drives = pd.DataFrame(data)
my_uber_drives

,start_date,end_date,category,start,stop,miles,purpose
0,2024-10-01 08:30:00,2024-10-01 09:00:00,Business,Downtown,Airport,12.5,Meeting
1,2024-10-01 10:00:00,2024-10-01 10:45:00,Personal,Airport,Downtown,18.3,Leisure
2,2024-10-02 12:15:00,2024-10-02 13:00:00,Business,Office,Client Site,10.8,Client Visit
3,2024-10-03 15:30:00,2024-10-03 16:15:00,Personal,Mall,Home,15.6,Shopping
4,2024-10-04 09:45:00,2024-10-04 10:30:00,Business,Station,Downtown,5.4,Meeting

In [102]:
my_uber_drivesB = my_uber_drives[my_uber_drives['category']=='Business']
my_uber_drivesB.groupby(by=['purpose']).sum(numeric_only=True).sort_values(['miles'], ascending=False).head(3)

              miles
purpose
Meeting        17.9
Client Visit   10.8

In [117]:
data = {
    'id' : [1,2,3,4,5,6,7,8,9],
    'salary' : [1000, 1000, 2000, 3000, 5000, 10000, 2000, 2000, 2000]
 }

df = pd.DataFrame(data)
df

   id  salary
0   1    1000
1   2    1000
2   3    2000
3   4    3000
4   5    5000
5   6   10000
6   7    2000
7   8    2000
8   9    2000

In [119]:
df.drop_duplicates(subset='salary')

   id  salary
0   1    1000
2   3    2000
3   4    3000
4   5    5000
5   6   10000